modm-ext/data.modm.io/docs/svd/header_stm32h5f5xx.svd
        <register>
          <name>OPTSR2_PRG</name>
          <description>FLASH option status to program register 2</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRAM1_3_4_5_RST</name>
              <description>SRAM1, SRAM3, SRAM4 and SRAM5 erased when a system reset occurs</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2_RST</name>
              <description>SRAM2 erased when a system reset occurs</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKPRAM_ECC</name>
              <description>Backup RAM ECC detection and correction enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM3_ECC</name>
              <description>SRAM3 ECC detection and correction enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM2_ECC</name>
              <description>SRAM2 ECC detection and correction disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USBPD_DIS</name>
              <description>USB power delivery configuration disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HUK_PUF</name>
              <description>HUK source is PUF</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TZEN</name>
              <description>TrustZone enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>NSBOOTR_CUR</name>
          <description>FLASH non-secure unique boot entry current register</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>NSBOOTR_PRG</name>
          <description>FLASH non-secure unique boot entry to program register</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BOOT_LOCK</name>
              <description>Boot Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BOOTADD</name>
              <description>Boot address</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SECBOOTR_CUR</name>
          <description>FLASH secure unique boot entry current register</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBOOTR_PRG</name>
          <description>FLASH secure unique boot entry to program register</description>
          <addressOffset>0x8c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BOOT_LOCK</name>
              <description>Boot Lock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>BOOTADD</name>
              <description>Boot address</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OTPBLR_CUR</name>
          <description>FLASH OTP block lock current register</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>OTPBLR_PRG</name>
          <description>FLASH OTP block Lock to program register</description>
          <addressOffset>0x94</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>WRP12R_CUR</name>
          <description>FLASH write sector group 1 protection for Bank2 current register</description>
          <addressOffset>0x98</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>WRP12R_PRG</name>
          <description>FLASH write sector group 1 protection for Bank2 to program register</description>
          <addressOffset>0x9c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB1R1</name>
          <description>FLASH secure block-based bank 1 register 1</description>
          <addressOffset>0xa0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB1R2</name>
          <description>FLASH secure block-based bank 1 register 2</description>
          <addressOffset>0xa4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB1R3</name>
          <description>FLASH secure block-based bank 1 register 3</description>
          <addressOffset>0xa8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB1R4</name>
          <description>FLASH secure block-based bank 1 register 4</description>
          <addressOffset>0xac</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB1R5</name>
          <description>FLASH secure block-based bank 1 register 5</description>
          <addressOffset>0xb0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB1R6</name>
          <description>FLASH secure block-based bank 1 register 6</description>
          <addressOffset>0xb4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB1R7</name>
          <description>FLASH secure block-based bank 1 register 7</description>
          <addressOffset>0xb8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB1R8</name>
          <description>FLASH secure block-based bank 1 register 8</description>
          <addressOffset>0xbc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB1R1</name>
          <description>FLASH privilege block-based bank 1 register 1</description>
          <addressOffset>0xc0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB1R2</name>
          <description>FLASH privilege block-based bank 1 register 2</description>
          <addressOffset>0xc4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB1R3</name>
          <description>FLASH privilege block-based bank 1 register 3</description>
          <addressOffset>0xc8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB1R4</name>
          <description>FLASH privilege block-based bank 1 register 4</description>
          <addressOffset>0xcc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB1R5</name>
          <description>FLASH privilege block-based bank 1 register 5</description>
          <addressOffset>0xd0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB1R6</name>
          <description>FLASH privilege block-based bank 1 register 6</description>
          <addressOffset>0xd4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB1R7</name>
          <description>FLASH privilege block-based bank 1 register 7</description>
          <addressOffset>0xd8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB1R8</name>
          <description>FLASH privilege block-based bank 1 register 8</description>
          <addressOffset>0xdc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECWM1R_CUR</name>
          <description>FLASH secure watermark 1 current register</description>
          <addressOffset>0xe0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECWM1R_PRG</name>
          <description>FLASH secure watermark 1 to program register</description>
          <addressOffset>0xe4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>WRP11R_CUR</name>
          <description>FLASH write sector group protection current register for bank1</description>
          <addressOffset>0xe8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>WRP11R_PRG</name>
          <description>FLASH write sector group protection to program register for bank1</description>
          <addressOffset>0xec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EDATA1R_CUR</name>
          <description>FLASH data sectors configuration current register for bank1</description>
          <addressOffset>0xf0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EDATA1R_PRG</name>
          <description>FLASH data sectors configuration to program register for bank1</description>
          <addressOffset>0xf4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HDP1R_CUR</name>
          <description>FLASH HDP configuration current register for bank1</description>
          <addressOffset>0xf8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HDP1R_PRG</name>
          <description>FLASH HDP configuration to program register for bank1</description>
          <addressOffset>0xfc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ECCCORR</name>
          <description>FLASH ECC correction register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>ECCDETR</name>
          <description>FLASH ECC detection register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR_ECC</name>
              <description>ECC fail address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
            </field>
            <field>
              <name>OBK_ECC</name>
              <description>Flash OB Keys storage area ECC fail</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATA_ECC</name>
              <description>Flash high-cycle data ECC fail</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BK_ECC</name>
              <description>ECC fail bank</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SYSF_ECC</name>
              <description>System Flash ECC fail</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OTP_ECC</name>
              <description>Flash OTP ECC fail</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCIE</name>
              <description>ECC correction interrupt enable</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCC</name>
              <description>ECC correction</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCD</name>
              <description>ECC detection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCDR</name>
          <description>FLASH ECC data register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FAIL_DATA</name>
              <description>ECC fail data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WRP22R_CUR</name>
          <description>FLASH write sector group 2 protection for Bank2 current register</description>
          <addressOffset>0x198</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>WRP22R_PRG</name>
          <description>FLASH write sector group 2 protection for Bank2 to program register</description>
          <addressOffset>0x19c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB2R1</name>
          <description>FLASH secure block-based bank 2 register 1</description>
          <addressOffset>0x1a0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB2R2</name>
          <description>FLASH secure block-based bank 2 register 2</description>
          <addressOffset>0x1a4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB2R3</name>
          <description>FLASH secure block-based bank 2 register 3</description>
          <addressOffset>0x1a8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB2R4</name>
          <description>FLASH secure block-based bank 2 register 4</description>
          <addressOffset>0x1ac</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB2R5</name>
          <description>FLASH secure block-based bank 2 register 5</description>
          <addressOffset>0x1b0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB2R6</name>
          <description>FLASH secure block-based bank 2 register 6</description>
          <addressOffset>0x1b4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB2R7</name>
          <description>FLASH secure block-based bank 2 register 7</description>
          <addressOffset>0x1b8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECBB2R8</name>
          <description>FLASH secure block-based bank 2 register 8</description>
          <addressOffset>0x1bc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB2R1</name>
          <description>FLASH privilege block-based bank 2 register 1</description>
          <addressOffset>0x1c0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB2R2</name>
          <description>FLASH privilege block-based bank 2 register 2</description>
          <addressOffset>0x1c4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB2R3</name>
          <description>FLASH privilege block-based bank 2 register 3</description>
          <addressOffset>0x1c8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB2R4</name>
          <description>FLASH privilege block-based bank 2 register 4</description>
          <addressOffset>0x1cc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB2R5</name>
          <description>FLASH privilege block-based bank 2 register 5</description>
          <addressOffset>0x1d0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB2R6</name>
          <description>FLASH privilege block-based bank 2 register 6</description>
          <addressOffset>0x1d4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB2R7</name>
          <description>FLASH privilege block-based bank 2 register 7</description>
          <addressOffset>0x1d8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>PRIVBB2R8</name>
          <description>FLASH privilege block-based bank 2 register 8</description>
          <addressOffset>0x1dc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECWM2R_CUR</name>
          <description>FLASH secure watermark 2 current register</description>
          <addressOffset>0x1e0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>SECWM2R_PRG</name>
          <description>FLASH secure watermark 2 to program register</description>
          <addressOffset>0x1e4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>WRP21R_CUR</name>
          <description>FLASH write sector group protection current register for bank2</description>
          <addressOffset>0x1e8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>WRP21R_PRG</name>
          <description>FLASH write sector group protection to program register for bank2</description>
          <addressOffset>0x1ec</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EDATA2R_CUR</name>
          <description>FLASH data sectors configuration current register for bank2</description>
          <addressOffset>0x1f0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>EDATA2R_PRG</name>
          <description>FLASH data sectors configuration to program register for bank2</description>
          <addressOffset>0x1f4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HDP2R_CUR</name>
          <description>FLASH HDP configuration current register for bank2</description>
          <addressOffset>0x1f8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
        <register>
          <name>HDP2R_PRG</name>
          <description>FLASH HDP configuration to program register for bank2</description>
          <addressOffset>0x1fc</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
        </register>
