modm-ext/data.modm.io/docs/svd/header_stm32h5f5xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA2D</name>
      <description>DMA2D Controller</description>
      <groupName>DMA2D</groupName>
      <baseAddress>0x4002a000</baseAddress>
      <interrupt>
        <name>DMA2D</name>
        <description>DMA2D global interrupt</description>
        <value>134</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>DMA2D control register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>START</name>
              <description>Start transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspend transfer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ABORT</name>
              <description>Abort transfer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOM</name>
              <description>Line offset mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PIXELS</name>
                  <description>Line offsets are expressed in pixels</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTES</name>
                  <description>Line offsets are expressed in bytes</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>DMA2D Mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M2M</name>
                  <description>DMA2D memory to memory transfer mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2M_PFC</name>
                  <description>DMA2D memory to memory with pixel format conversion transfer mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2M_BLEND</name>
                  <description>DMA2D memory to memory with blending transfer mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R2M</name>
                  <description>DMA2D register to memory transfer mode</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2M_BLEND_FIXED_COLOR_FG</name>
                  <description>DMA2D memory to memory with blending transfer mode and fixed color foreground</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M2M_BLEND_FIXED_COLOR_BG</name>
                  <description>DMA2D memory to memory with blending transfer mode and fixed color background</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>DMA2D interrupt status register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEIF</name>
              <description>Transfer Error Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIF</name>
              <description>Transfer Complete Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIF</name>
              <description>Transfer Watermark Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAEIF</name>
              <description>CLUT Access Error Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <description>CLUT Transfer Complete Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIF</name>
              <description>Configuration Error Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBCIF</name>
              <description>Read Bus Error Interrupt Flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBEIF</name>
              <description>Read Bus Error Interrupt Flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLSIF</name>
              <description>CLUT Loading Suspend Interrupt Flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEIF</name>
              <description>CLUT Loading Error Interrupt Flag</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPF0IF</name>
              <description>General Purpose Flag 0 Interrupt Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPF1IF</name>
              <description>General Purpose Flag 1 Interrupt Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPF2IF</name>
              <description>General Purpose Flag 2 Interrupt Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPF3IF</name>
              <description>General Purpose Flag 3 Interrupt Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>DMA2D interrupt enable register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TEIE</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TWIE</name>
              <description>Transfer Watermark Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAEIE</name>
              <description>CLUT Access Error Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIE</name>
              <description>CLUT Transfer Complete Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CEIE</name>
              <description>Configuration Error Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBCIE</name>
              <description>Configuration Error Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBEIE</name>
              <description>Configuration Error Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLSIE</name>
              <description>Configuration Error Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEIE</name>
              <description>Configuration Error Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPF0IE</name>
              <description>General Purpose Flag 0 Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPF1IE</name>
              <description>General Purpose Flag 1 Interrupt Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPF2IE</name>
              <description>General Purpose Flag 2 Interrupt Enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GPF3IE</name>
              <description>General Purpose Flag 3 Interrupt Enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IFCR</name>
          <description>DMA2D interrupt flag clear register</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CTEIF</name>
              <description>Clears Transfer Error Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTCIF</name>
              <description>Clears Transfer Complete Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTWIF</name>
              <description>Clears Transfer Watermark Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAECIF</name>
              <description>Clears CLUT Access Error Interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCTCIF</name>
              <description>Clears CLUT Transfer Complete Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCEIF</name>
              <description>Clears Configuration Error Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBCIE</name>
              <description>Clears Configuration Error Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RBEIE</name>
              <description>Clears Configuration Error Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLSIE</name>
              <description>Clears Configuration Error Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CLEIE</name>
              <description>Clears Configuration Error Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGPF0IF</name>
              <description>Clears General Purpose Flag 0 Interrupt Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGPF1IF</name>
              <description>Clears General Purpose Flag 1 Interrupt Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGPF2IF</name>
              <description>Clears General Purpose Flag 2 Interrupt Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CGPF3IF</name>
              <description>Clears General Purpose Flag 3 Interrupt Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGMAR</name>
          <description>DMA2D foreground memory address register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MA</name>
              <description>Foreground Memory Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGOR</name>
          <description>DMA2D foreground</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LO</name>
              <description>Line Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGMSR</name>
          <description>DMA2D foreground memory skip register</description>
          <addressOffset>0x4c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HPRE</name>
              <description>Line Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>HTRAIL</name>
              <description>Line Offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VPRE</name>
              <description>Line Offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>VTRAIL</name>
              <description>Line Offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>FGPFCCR</name>
          <description>DMA2D foreground PFC control register</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CM</name>
              <description>Input color mode CM[3:0]</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARGB8888</name>
                  <description>ARGB8888</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB888</name>
                  <description>RGB888</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB565</name>
                  <description>RGB565</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB1555</name>
                  <description>ARGB1555</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB4444</name>
                  <description>ARGB4444</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L8</name>
                  <description>L8</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AL44</name>
                  <description>AL44</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AL88</name>
                  <description>AL88</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>L4</name>
                  <description>L4</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A8</name>
                  <description>A8</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A4</name>
                  <description>A4</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARGB2222</name>
                  <description>ARGB2222</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>START</name>
              <description>Start</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CS</name>
              <description>CLUT size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>AM</name>
              <description>Alpha mode AM[1:0]</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_MODIF</name>
                  <description>No modification of the alpha channel value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPLACE</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMBINE</name>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSS</name>
              <description>Chroma Sub-Sampling</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSS_444</name>
                  <description>No chroma sub-sampling 4:4:4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSS_422</name>
                  <description>chroma sub-sampling 4:2:2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSS_420</name>
                  <description>chroma sub-sampling 4:2:0</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AI</name>
              <description>Foreground Input Alpha Inverted</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGULAR</name>
                  <description>Regular alpha</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>Inverted alpha</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RBS</name>
              <description>Foreground Input Red Blue Swap</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REGULAR</name>
                  <description>RGB or ARGB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWAP</name>
                  <description>BGR or ABGR</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APOS</name>
              <description>Alpha Inverted Position</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Alpha value</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
