modm-ext/data.modm.io/docs/svd/header_stm32h5f5xx.svd
        <register>
          <name>CFGR2</name>
          <description>ADC configuration register 2</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ROVSE</name>
              <description>ADC oversampler enable on scope ADC group regular</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>JOVSE</name>
              <description>ADC oversampler enable on scope ADC group injected</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVSR</name>
              <description>ADC oversampling ratio</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RATIO_2</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_4</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_8</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_16</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_32</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_64</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_128</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RATIO_256</name>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVSS</name>
              <description>ADC oversampling shift</description>
              <bitOffset>5</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_1</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_2</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_3</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_4</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_5</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_6</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_7</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RIGHT_8</name>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TROVS</name>
              <description>ADC oversampling discontinuous mode (triggered mode) for ADC group regular</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONT</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONT</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ROVSM</name>
              <description>ADC oversampling mode managing interlaced conversions of ADC group regular and group injected</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCOMP</name>
              <description>ADC Gain Compensation mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWTRIG</name>
              <description>ADC Software Trigger Bit for Sample time control trigger mode</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BULB</name>
              <description>ADC Bulb sampling mode</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SMPTRIG</name>
              <description>ADC Sample Time Control Trigger mode</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LFTRIG</name>
              <description>ADC Low Frequency Trigger</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR1</name>
          <description>ADC sampling time register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMP0</name>
              <description>ADC channel 0 sampling time selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP1</name>
              <description>ADC channel 1 sampling time selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP2</name>
              <description>ADC channel 2 sampling time selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP3</name>
              <description>ADC channel 3 sampling time selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP4</name>
              <description>ADC channel 4 sampling time selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP5</name>
              <description>ADC channel 5 sampling time selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP6</name>
              <description>ADC channel 6 sampling time selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP7</name>
              <description>ADC channel 7 sampling time selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP8</name>
              <description>ADC channel 8 sampling time selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP9</name>
              <description>ADC channel 9 sampling time selection</description>
              <bitOffset>27</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMPPLUS</name>
              <description>ADC channels sampling time additional setting</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>ADC sampling time let to default settings.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMMON_3C5_REPL_2C5</name>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMPR2</name>
          <description>ADC sampling time register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SMP10</name>
              <description>ADC channel 10 sampling time selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP11</name>
              <description>ADC channel 11 sampling time selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP12</name>
              <description>ADC channel 12 sampling time selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP13</name>
              <description>ADC channel 13 sampling time selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP14</name>
              <description>ADC channel 14 sampling time selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP15</name>
              <description>ADC channel 15 sampling time selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP16</name>
              <description>ADC channel 16 sampling time selection</description>
              <bitOffset>18</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP17</name>
              <description>ADC channel 17 sampling time selection</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SMP18</name>
              <description>ADC channel 18 sampling time selection</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TR1</name>
          <description>ADC analog watchdog 1 threshold register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LT1</name>
              <description>ADC analog watchdog 1 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
            <field>
              <name>AWDFILT</name>
              <description>ADC analog watchdog filtering parameter</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>HT1</name>
              <description>ADC analog watchdog 1 threshold high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TR2</name>
          <description>ADC analog watchdog 2 threshold register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LT2</name>
              <description>ADC analog watchdog 2 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HT2</name>
              <description>ADC analog watchdog 2 threshold high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TR3</name>
          <description>ADC analog watchdog 3 threshold register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LT3</name>
              <description>ADC analog watchdog 3 threshold low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>HT3</name>
              <description>ADC analog watchdog 3 threshold high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR1</name>
          <description>ADC group regular sequencer register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>L</name>
              <description>ADC group regular sequencer scan length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_2RANKS</name>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_3RANKS</name>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_4RANKS</name>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_5RANKS</name>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_6RANKS</name>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_7RANKS</name>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_8RANKS</name>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_9RANKS</name>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_10RANKS</name>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_11RANKS</name>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_12RANKS</name>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_13RANKS</name>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_14RANKS</name>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_15RANKS</name>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE_16RANKS</name>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SQ1</name>
              <description>ADC group regular sequencer rank 1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ2</name>
              <description>ADC group regular sequencer rank 2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ3</name>
              <description>ADC group regular sequencer rank 3</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ4</name>
              <description>ADC group regular sequencer rank 4</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR2</name>
          <description>ADC group regular sequencer register 2</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SQ5</name>
              <description>ADC group regular sequencer rank 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ6</name>
              <description>ADC group regular sequencer rank 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ7</name>
              <description>ADC group regular sequencer rank 7</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ8</name>
              <description>ADC group regular sequencer rank 8</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ9</name>
              <description>ADC group regular sequencer rank 9</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR3</name>
          <description>ADC group regular sequencer register 3</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SQ10</name>
              <description>ADC group regular sequencer rank 10</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ11</name>
              <description>ADC group regular sequencer rank 11</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ12</name>
              <description>ADC group regular sequencer rank 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ13</name>
              <description>ADC group regular sequencer rank 13</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ14</name>
              <description>ADC group regular sequencer rank 14</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SQR4</name>
          <description>ADC group regular sequencer register 4</description>
          <addressOffset>0x3c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SQ15</name>
              <description>ADC group regular sequencer rank 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>SQ16</name>
              <description>ADC group regular sequencer rank 16</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>ADC group regular data register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RDATA</name>
              <description>ADC group regular conversion data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
