modm-ext/data.modm.io/docs/svd/header_stm32h5f5xx.svd
        <register>
          <name>LE5CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x74</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE6CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x78</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE7CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x7c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE8CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x80</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE9CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x84</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LE10CFG1</name>
          <description>PLAY Logic Element Configuration Registers 1</description>
          <addressOffset>0x88</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>LUT</name>
              <description>Look-Up Table contents</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LUT0</name>
                  <description>Lookup table 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT1</name>
                  <description>Lookup table 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT2</name>
                  <description>Lookup table 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT3</name>
                  <description>Lookup table 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT4</name>
                  <description>Lookup table 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT5</name>
                  <description>Lookup table 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT6</name>
                  <description>Lookup table 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT7</name>
                  <description>Lookup table 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT8</name>
                  <description>Lookup table 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT9</name>
                  <description>Lookup table 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT10</name>
                  <description>Lookup table 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT11</name>
                  <description>Lookup table 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT12</name>
                  <description>Lookup table 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT13</name>
                  <description>Lookup table 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT14</name>
                  <description>Lookup table 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LUT15</name>
                  <description>Lookup table 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
