modm-ext/data.modm.io/docs/svd/header_stm32h5f5xx.svd
    <peripheral derivedFrom="USART2">
      <name>USART6_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50006400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART10_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50006800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART11_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50006c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="CEC">
      <name>CEC_S</name>
      <description>Consumer Electronics Control</description>
      <groupName>CEC</groupName>
      <baseAddress>0x50007000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART7_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50007800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART8_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50007c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART9_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50008000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UART4">
      <name>UART12_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50008400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DTS">
      <name>DTS_S</name>
      <description>DTS</description>
      <groupName>DTS</groupName>
      <baseAddress>0x50008c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LPTIM2">
      <name>LPTIM2_S</name>
      <description>LPTIMER</description>
      <groupName>LPTIM</groupName>
      <baseAddress>0x50009400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN3">
      <name>FDCAN3_S</name>
      <description>FD Controller Area Network</description>
      <groupName>FDCAN_Global</groupName>
      <baseAddress>0x5000a000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN3">
      <name>FDCAN1_S</name>
      <description>FD Controller Area Network</description>
      <groupName>FDCAN_Global</groupName>
      <baseAddress>0x5000a400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN_CONFIG">
      <name>FDCAN_CONFIG_S</name>
      <description>FD Controller Area Network Configuration</description>
      <groupName>FDCAN_Config</groupName>
      <baseAddress>0x5000a500</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FDCAN3">
      <name>FDCAN2_S</name>
      <description>FD Controller Area Network</description>
      <groupName>FDCAN_Global</groupName>
      <baseAddress>0x5000a800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="UCPD1">
      <name>UCPD1_S</name>
      <description>UCPD</description>
      <groupName>UCPD</groupName>
      <baseAddress>0x5000dc00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM1">
      <name>TIM1_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50012c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI1_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x50013000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM8">
      <name>TIM8_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50013400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="USART2">
      <name>USART1_S</name>
      <description>Universal Synchronous Asynchronous Receiver Transmitter</description>
      <groupName>USART</groupName>
      <baseAddress>0x50013800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM15">
      <name>TIM15_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50014000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM16">
      <name>TIM16_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50014400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="TIM16">
      <name>TIM17_S</name>
      <description>TIM</description>
      <groupName>TIM</groupName>
      <baseAddress>0x50014800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI4_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x50014c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SPI2">
      <name>SPI6_S</name>
      <description>SPI</description>
      <groupName>SPI</groupName>
      <baseAddress>0x50015000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SAI1">
      <name>SAI1_S</name>
      <description>Serial Audio Interface</description>
      <groupName>SAI</groupName>
      <baseAddress>0x50015400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="SAI1">
      <name>SAI2_S</name>
      <description>Serial Audio Interface</description>
      <groupName>SAI</groupName>
      <baseAddress>0x50015800</baseAddress>
    </peripheral>
    <peripheral derivedFrom="LTDC">
      <name>LTDC_S</name>
      <description>LCD-TFT Display Controller</description>
      <groupName>LTDC</groupName>
      <baseAddress>0x50016c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GFXTIM">
      <name>GFXTIM_S</name>
      <description>GFXTIM</description>
      <groupName>GFXTIM</groupName>
      <baseAddress>0x50017400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPDMA1">
      <name>GPDMA1_S</name>
      <description>DMA Controller</description>
      <groupName>DMA</groupName>
      <baseAddress>0x50020000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPDMA1">
      <name>GPDMA2_S</name>
      <description>DMA Controller</description>
      <groupName>DMA</groupName>
      <baseAddress>0x50021000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FLASH">
      <name>FLASH_S</name>
      <description>FLASH Registers</description>
      <groupName>FLASH</groupName>
      <baseAddress>0x50022000</baseAddress>
      <interrupt>
        <name>FLASH_S</name>
        <description>FLASH secure global interrupt</description>
        <value>7</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="CRC">
      <name>CRC_S</name>
      <description>CRC calculation unit</description>
      <groupName>CRC</groupName>
      <baseAddress>0x50023000</baseAddress>
    </peripheral>
