modm-ext/data.modm.io/docs/svd/header_stm32h5f5xx.svd
    <peripheral derivedFrom="SDMMC1">
      <name>SDMMC2_S</name>
      <description>Secure digital input/output Interface</description>
      <groupName>SDMMC</groupName>
      <baseAddress>0x56008c00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_OCTOSPI1_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x5600f000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="DLYB_SDMMC1">
      <name>DLYB_OCTOSPI2_S</name>
      <description>Delay Block DLYB</description>
      <groupName>DLYB</groupName>
      <baseAddress>0x5600f400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank1_R">
      <name>FMC_Bank1_R_S</name>
      <description>Flexible Memory Controller</description>
      <groupName>FMC_Bank1</groupName>
      <baseAddress>0x57000400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank3_R">
      <name>FMC_Bank3_R_S</name>
      <description>Flexible Memory Controller Bank3</description>
      <groupName>FMC_Bank3</groupName>
      <baseAddress>0x57000480</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank1E_R">
      <name>FMC_Bank1E_R_S</name>
      <description>Flexible Memory Controller Bank1E</description>
      <groupName>FMC_Bank1E</groupName>
      <baseAddress>0x57000504</baseAddress>
    </peripheral>
    <peripheral derivedFrom="FMC_Bank5_6_R">
      <name>FMC_Bank5_6_R_S</name>
      <description>Flexible Memory Controller Bank5 and 6</description>
      <groupName>FMC_Bank5_6</groupName>
      <baseAddress>0x57000540</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPI1">
      <name>OCTOSPI1_S</name>
      <description>OCTO Serial Peripheral Interface</description>
      <groupName>XSPI</groupName>
      <baseAddress>0x57001400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPI1">
      <name>OCTOSPI2_S</name>
      <description>OCTO Serial Peripheral Interface</description>
      <groupName>XSPI</groupName>
      <baseAddress>0x57002400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="OCTOSPIM">
      <name>OCTOSPIM_S</name>
      <description>Serial Peripheral Interface IO Manager</description>
      <groupName>XSPIM</groupName>
      <baseAddress>0x57003400</baseAddress>
    </peripheral>
  </peripherals>
</device>
